/*******************************************************************************
 * 文件名称：SHT11.h
 * 功    能：SHT11温湿度传感器驱动的头文件
 ******************************************************************************/

#ifndef _SHT11_H_
#define _SHT11_H_


/* 包含头文件 */
/********************************************************************/
#include "ioCC2530.h"  // CC2530的头文件，包含对CC2530的寄存器、中断向量等的定义
#include "math.h"      // 包含数学库头文件
#include "hal_cc8051.h"//
/********************************************************************/

/* 宏定义 */
/*===================================================*/
/* 
   控制SHT11的相关引脚定义 
 */
#define SHT11_PROTSEL           P0SEL
#define SHT11_PORTDIR           P0DIR
#define SCK_BIT                (BIT0)
#define DATA_BIT               (BIT7)


#define SHT11_SCK              P0_0
#define SHT11_DATA             P0_7

/* 
   SHT11相关命令定义 
 */
#define SHT11_CMD_STATUS_REG_W 0x06  // "写状态寄存器"命令
#define SHT11_CMD_STATUS_REG_R 0x07  // "读状态寄存器"命令
#define SHT11_CMD_MEASURE_TEMP 0x03  // "测量温度"命令
#define SHT11_CMD_MEASURE_HUMI 0x05  // "测量相对湿度"命令
#define SHT11_CMD_RESET        0x1e  // "复位"命令

/* 
   SHT11应答标志定义 
 */
#define SHT11_noACK            0     // 不应答标志
#define SHT11_ACK              1     // 应答标志
/*===================================================*/


/* 定义枚举类型 */
/*===================================================*/
enum {SHT11_TEMP,SHT11_HUMI};  // 温度，相对湿度枚举类型
/*===================================================*/


/*********************************************************************
 * 函数名称：SHT11_ConnectionReset
 * 功    能：控制SHT11通信复位
 *                 _____________________________________________________         ________
 *           DATA:                                                      |_______|
 *                    _    _    _    _    _    _    _    _    _        ___     ___
 *           SCK : __| |__| |__| |__| |__| |__| |__| |__| |__| |______|   |___|   |______
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void SHT11_ConnectionReset(void);


/*********************************************************************
 * 函数名称：SHT11_Init
 * 功    能：SHT11初始化
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：无
 ********************************************************************/
void SHT11_Init(void);


/*********************************************************************
 * 函数名称：SHT11_SoftReset
 * 功    能：控制SHT11软件复位
 *                 _____________________________________________________         ________
 *           DATA:                                                      |_______|
 *                    _    _    _    _    _    _    _    _    _        ___     ___
 *           SCK : __| |__| |__| |__| |__| |__| |__| |__| |__| |______|   |___|   |______
 * 入口参数：无
 * 出口参数：无
 * 返 回 值：返回值为1表示SHT11未响应
 ********************************************************************/
char SHT11_SoftReset(void);


/*********************************************************************
 * 函数名称：SHT11_Measure
 * 功    能：进行一次测量(相对湿度或温度)
 * 入口参数：p_value      测量值
 *           checksum     校验和
 *           mode         TEMP表示进行温度测量
 *                        HUMI表示进行相对湿度测量
 * 出口参数：p_value      测量值
 * 返 回 值：返回值为1表示SHT11未响应
 ********************************************************************/
char SHT11_Measure(unsigned char *p_value, unsigned char *p_checksum, unsigned char mode);


/*********************************************************************
 * 函数名称：SHT11_CALC
 * 功    能：计算相对湿度和温度
 * 入口参数：p_humidity      SHT11采集到的相对湿度值
 *           p_temperature   SHT11采集到的温度值
 * 出口参数：p_humidity      实际物理量的值
 *           p_temperature   采实际物理量的值
 * 返 回 值：无
 ********************************************************************/
void SHT11_CALC(float *p_humidity ,float *p_temperature);


/*********************************************************************
 * 函数名称：SHT11_CALCDewpoint
 * 功    能：计算露点
 * 入口参数：h      相对湿度物理量值
 *           t      温度物理量值
 * 出口参数：无
 * 返 回 值：露点值
 ********************************************************************/
float SHT11_CALCDewpoint(float h,float t);



#endif

